OdStreamBuf.getShareMode
\details
Returns the share mode for this StreamBuf object.
\remarks
getShareMode returns one of the following:
Name                         Value       Description
Oda::kShareDenyReadWrite     0x10        deny read/write mode
Oda::kShareDenyWrite         0x20        deny write mode
Oda::kShareDenyRead          0x30        deny read mode
Oda::kShareDenyNo            0x40        deny none mode